&НаКлиенте
Перем Компонента;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПутьККартинке = "\test.png";       
	
	ВысотаКадра = 480;
	ШиринаКадра = 640; 
	ПутьКЗаписи = СформироватьПутьКЗаписи(); 
	
	Элементы.ДоступныеКодеки.СписокВыбора.Добавить("MJPG", "MJPEG");
	Элементы.ДоступныеКодеки.СписокВыбора.Добавить("H264", "H.264");
	Элементы.ДоступныеКодеки.СписокВыбора.Добавить("XVID", "XVID");
	ДоступныеКодеки = "MJPG";
	
КонецПроцедуры

&НаКлиенте
Процедура ОТправитьКоманду(Команда)
	ВызватьИсключение "Не реализовано. Оставил для примера";
	ОчиститьСообщения();
	рез = Компонента.SendCommand("из 1с "+ТекущаяДата());
	Сообщить("Сенд "+рез);
	рез2 = Компонента.ReadMessage();
	Сообщить("Ответ "+рез2);
	
КонецПроцедуры

&НаКлиенте
Процедура стартКам(Команда)
	
	Компонента = новый COMОбъект("bslReader.BslDMReader");
	
	Компонента.InitCapture(ДоступныеКодеки);
	
	рез = Компонента.StartCam(0);  
	Сообщить(рез);  
КонецПроцедуры

&НаКлиенте
Процедура Стоп(Команда)
	рез = Компонента.StopCam();
	Компонента.StopRecord();
	Сообщить(рез);  
	Компонента = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура СтартИзФайла(Команда)
	Компонента = новый COMОбъект("bslReader.BslDMReader");
	рез = Компонента.ReadDMCodeFile(ПутьККартинке);  
	Сообщить(рез);  
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗапись(Команда)
	Если Компонента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Компонента.StartRecord(ПутьКЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьЗапись(Команда)
	Если Компонента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Компонента.StopRecord();	
КонецПроцедуры


&НаКлиенте
Процедура РазмерКадра(Команда)
	Если Компонента = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Компонента.SetSizeFrame(ВысотаКадра, ШиринаКадра);
	 
КонецПроцедуры


&НаКлиенте
Процедура НовыйПутьКЗаписи(Команда)
	ПутьКЗаписи = СформироватьПутьКЗаписи();
КонецПроцедуры

Функция СформироватьПутьКЗаписи()
	Возврат "F:\visualstudiopro\_mytest"+ Формат(ТекущаяДата(),"ДФ=MM_dd_ЧЧ_мм")+".avi";	
КонецФункции

&НаКлиенте
Процедура РазрешенияКамерыПриИзменении(Элемент)
  	Если Компонента = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	разм = СтрРазделить(РазрешенияКамеры,"*", ЛОжь);
	ВысотаКадра = Число(разм[1]);
	ШиринаКадра = Число(разм[0]);
	Компонента.SetSizeFrame(ВысотаКадра, ШиринаКадра);
КонецПроцедуры
