&НаКлиенте
Перем Компонента;


#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВысотаКадра = 480;
	ШиринаКадра = 640; 
	ПутьКЗаписи = БазовыйПутьКФайлу(); 
	Камера = "0";
	ДлинаВидео = 300;
	Элементы.ДоступныеКодеки.СписокВыбора.Добавить("MJPG", "MJPEG");
	Элементы.ДоступныеКодеки.СписокВыбора.Добавить("H264", "H.264");
	Элементы.ДоступныеКодеки.СписокВыбора.Добавить("XVID", "XVID");
	Элементы.ДоступныеКодеки.СписокВыбора.Добавить("MP4V", "MP4V");
	ДоступныеКодеки = "MJPG";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РазрешенияКамерыПриИзменении(Элемент)
  	Если Компонента = Неопределено Тогда
		Возврат;
	КонецЕсли;	     
	
	разм = СтрРазделить(РазрешенияКамеры,"*", ЛОжь);
	ВысотаКадра = Число(разм[1]);
	ШиринаКадра = Число(разм[0]);
	Компонента.SetSizeFrame(ВысотаКадра, ШиринаКадра);
	
КонецПроцедуры 
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОТправитьКоманду(Команда)
	ВызватьИсключение "Не реализовано. Оставил для примера";
	ОчиститьСообщения();
	рез = Компонента.SendCommand("из 1с "+ТекущаяДата());
	Сообщить("Сенд "+рез);
	рез2 = Компонента.ReadMessage();
	Сообщить("Ответ "+рез2);
	
КонецПроцедуры

&НаКлиенте
Процедура стартКам(Команда)
	
	Компонента = новый COMОбъект("bslCamViewer.bslCamViewer");
	
	Сообщить("Версия библиотеки: "+Компонента.VersionDLL());
	
	Компонента.InitCapture(ДоступныеКодеки);
	Компонента.SetSizeFrameView(720, 1280);
	
	рез = Компонента.StartCam(Камера);  
	Сообщить(рез);  
КонецПроцедуры

&НаКлиенте
Процедура Стоп(Команда)
	рез = Компонента.StopCam();
	Компонента.StopRecord();
	Компонента = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗапись(Команда)
	Если Компонента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Компонента.SetStringWaterMark(ИмяКомпьютера());
	Компонента.SetLenPartVideo(ДлинаВидео);
	
	Компонента.StartRecord(СформироватьПутьКЗаписи());
	
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьЗапись(Команда)
	Если Компонента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Компонента.StopRecord();	
	
КонецПроцедуры


&НаКлиенте
Процедура РазмерКадра(Команда)
	Если Компонента = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Компонента.SetSizeFrame(ВысотаКадра, ШиринаКадра);
	 
КонецПроцедуры
              
&НаКлиенте
Процедура НовыйПутьКЗаписи(Команда)
	ПутьКЗаписи = СформироватьПутьКЗаписи();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  
&НаКлиентеНаСервереБезКонтекста
Функция БазовыйПутьКФайлу()
	
	Возврат "E:\record\in\";	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьПутьКЗаписи()
	Возврат СтрШаблон("%1%2",БазовыйПутьКФайлу(), Формат(ТекущаяДата(),"ДФ=MM_dd_ЧЧ_мм"));
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РазрешенияКамеры()

	Разрешения = Новый Массив;
	Разрешения.Добавить("160х120");
	Разрешения.Добавить("240х160");
	Разрешения.Добавить("480х360");  
	Разрешения.Добавить("640х480");
	
	Возврат Разрешения;
	
КонецФункции
#КонецОбласти